[
  {
      "id": "10.1021/acs.jctc.4c01682",
      "title": "Accurate Predictions of Molecular Properties of Proteins via Graph Neural Networks and Transfer Learning",
      "topic": "Journal of Chemical Theory and Computation",
      "date": "April 24, 2025",
      "name": "Spencer Wozniak, Giacomo Janson, Michael Feig",
      "contents": "Machine learning has emerged as a promising approach for predicting molecular properties of proteins, as it addresses limitations of experimental and traditional computational methods. Here, we introduce GSnet, a graph neural network (GNN) trained to predict physicochemical and geometric properties including solvation-free energies, diffusion constants, and hydrodynamic radii, based on three-dimensional protein structures. By leveraging transfer learning, pretrained GSnet embeddings were adapted to predict solvent-accessible surface area (SASA) and residue-specific pKa values, achieving high accuracy and generalizability. Notably, GSnet outperformed existing protein embeddings for SASA prediction and a locally charge-aware variant, aLCnet, approached the accuracy of simulation-based and empirical methods for pKa prediction. Our GNN framework demonstrated robustness across diverse data sets, including intrinsically disordered peptides, and scalability for high-throughput applications. These results highlight the potential of GNN-based embeddings and transfer learning to advance protein structure analysis, providing a foundation for integrating predictive models into proteome-wide studies and structural biology pipelines.",      
      "image": [],
      "keywords": [
      ]
    },
    {
      "id": "10.1021/acs.jpcb.4c06877",
      "title": "Diffusion and Viscosity in Mixed Protein Solutions",
      "topic": "The Journal of Physical Chemistry B",
      "date": "November 19, 2024",
      "name": "Spencer Wozniak & Michael Feig",
      "contents": "The viscosity and diffusion properties of crowded protein systems were investigated with molecular dynamics simulations of SH3 mixtures with different crowders, and results were compared with experimental data. The simulations accurately reproduced experimental trends across a wide range of protein concentrations, including highly crowded environments up to 300 g/L. Notably, viscosity increased with crowding but varied little between different crowder types, while diffusion rates were significantly reduced depending on protein–protein interaction strength. Analysis using the Stokes–Einstein relation indicated that the reduction in diffusion exceeded what was expected from viscosity changes alone, with the additional slow-down attributable to transient cluster formation driven by weakly attractive interactions. Contact kinetics analysis further revealed that longer-lived interactions contributed more significantly to reduced diffusion rates than short-lived interactions. This study also highlights the accuracy of current computational methodologies for capturing the dynamics of proteins in highly concentrated solutions and provides insights into the molecular mechanisms affecting protein mobility in crowded environments.",
      "image": [],
      "keywords": [
      ]
    }
]
  